# Форматированный вывод в С++

> В C++ форматированный вывод осуществляется с помощью манипуляторов, которые мы можем использовать вместе с оператором вывода cout или другого потока вывода. В общем виде это выглядит так:

```cpp

cout << манипулятор1 << манипулятор2 << ... << манипуляторN << значение1 << значение2 << ... << значениеN << endl;

```

## Setw

> setw - устанавливает ширину поля вывода. Если ширина поля меньше, чем длина выводимого значения, то значение выводится без изменений. Если ширина поля больше, чем длина выводимого значения, то значение выравнивается по правому краю поля. Можно задать символ заполнения поля, который будет выводиться вместо пробелов. Также можно выравнивать по левому краю поля, используя флаг left. Флаг right выводит по правому краю.

```cpp
#include <iostream>
#include <iomanip>

using namespace std;

int main() {
    int a = 5;
    cout << "a = |" << a << "|" << endl;                                // a = |5|
    cout << "a = |" << setw(10) << a << "|" << endl;                    // a = |         5|
    cout << "a = |" << left << setw(10) << a << "|" << endl;            // a = |5         |
    cout << "a = |" << setw(10) << setfill('0') << a << "|" << endl;    // a = |0000000005|
    int num = 123;
    cout << setfill('*') << setw(10) << num << endl; // *******123
    return 0;
}
```
## Setprecision

> `setprecision` - устанавливает количество цифр после запятой, которые будут выводиться при выводе чисел с плавающей точкой. Если количество цифр после запятой меньше, чем количество цифр в числе, то число выводится без изменений. Если количество цифр после запятой больше, чем количество цифр в числе, то число округляется. По умолчанию `setprecision` сделает, чтобы выводилось N цифр всего. Если надо чтобы выводилось именно N чисел после запятой, используйте `fixed` перед `setprecision`. Часто их используют в связке.

```cpp
#include <iostream>
#include <iomanip>
#include <cmath>

using namespace std;

int main()
{
    double a = 3.14159265358979323846;
    cout << "a = " << a << endl;                     // a = 3.14159
    cout << "a = " << setprecision(10) << a << endl; // a = 3.1415926536
    cout << "a = " << setprecision(2) << a << endl;  // a = 3.1
    cout << "a = " << setprecision(2) << a * 10 << endl;  // a = 31
    cout << "a = " << fixed << setprecision(2) << a << endl;  // a = 3.14
    cout << "a = " << fixed << setprecision(2) << a * 10 << endl;  // a = 31.42 (округляет)
    
    // Если нужно вывести без арифметического округления, округляем сами:
    cout << "a = " << fixed << setprecision(2) << floor(a * 1000) / 100 << endl; // a = 31.41
    
    return 0;
}
```

## hex, dec, oct

Манипуляторы hex, dec и oct устанавливают систему счисления для вывода чисел. hex выводит число в шестнадцатеричной системе счисления, dec - в десятичной системе счисления, а oct - в восьмеричной системе счисления.

```cpp
#include <iostream>
#include <iomanip>

using namespace std;

int main() {
    int num = 123;
    cout << hex << num << endl;
    cout << dec << num << endl;
    cout << oct << num << endl;
    return 0;
}
```

Вывод:

```
7b
123
173
```
# Практика
1. Напишите программу, которая запрашивает у пользователя два числа с плавающей точкой и выводит их сумму с точностью до двух знаков после запятой со стандартным арифметическим округлением.
2. Напишите программу, которая запрашивает у пользователя число и выводит его в двоичной, восьмеричной и шестнадцатеричной системах счисления, используя функции hex(), dec() и oct().
3. Напишите программу, которая запрашивает у пользователя два числа с плавающей точкой и выводит их сумму с точностью до двух знаков после запятой с округлением вниз. *(Было на кр в том году)*
4. Введите с файла 5 ФИО. А можно и больше 5, например, скопируйте из журнала все ФИО. Задача - вывести номер, фамилию, имя, отчество в таком табличном формате: 
```
/==========================================\
|  1|Иванов      |Иван        |Иванович    |
|  2|Иванов      |Иван        |Иванович    |
| 15|Фамилия     |Длиинное_Имя|Отчество    |
\==========================================/
```


Поля с именем, фамилией, отчеством должны занимать ровно 12 знакомест. То есть если имя занимает 5 символов, после него должно быть еще 7 пробелов. Обратите внимание, что для ФИО выравнивание по левому краю, а для номеров - по правому.

> ВНИМАНИЕ! В этом задании для работы с русским текстом используйте `setlocale(LC_ALL, "");` в начале кода. Также вместо `string, cin, cout` используйте `wstring, wcin, wcout`.
